package main

import "fmt"

func main() {

	var meter int

	var kilometer float32

	var declensionMeter = map[int]string{
		0:  "метров",
		1:  "метр",
		2:  "метра",
		3:  "метра",
		4:  "метра",
		5:  "метров",
		6:  "метров",
		7:  "мертов",
		8:  "метров",
		9:  "метров",
		10: "метров",
		11: "метров",
		12: "метров",
		13: "метров",
		14: "метров",
		15: "метров",
		16: "метров",
		17: "метров",
		18: "метров",
		19: "метров",
		20: "метров",
	}

	var declensionKilometer = map[int]string{
		0:  "километров",
		1:  "километр",
		2:  "километра",
		3:  "километра",
		4:  "километра",
		5:  "километров",
		6:  "километров",
		7:  "киломертов",
		8:  "километров",
		9:  "километров",
		10: "километров",
		11: "километров",
		12: "километров",
		13: "километров",
		14: "километров",
		15: "километров",
		16: "километров",
		17: "километров",
		18: "километров",
		19: "километров",
		20: "километров",
	}

	fmt.Println("Введите число:")
	fmt.Scan(&meter)

	kilometer = float32(meter) / 1000

	fmt.Printf("%d %s - это %f %s", meter, declensionMeter[meter%10], kilometer, declensionKilometer[int(kilometer*1000)%10])
}
